-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 31 2024 г., 20:27
-- Версия сервера: 5.6.51
-- Версия PHP: 7.4.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `english`
--

-- --------------------------------------------------------

--
-- Структура таблицы `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2019_08_19_000000_create_failed_jobs_table', 1),
(2, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(3, '2021_09_17_141113_create_words_table', 1),
(4, '2021_09_17_142851_create_word_types_table', 1),
(5, '2021_09_23_163922_create_sentences_table', 1),
(6, '2021_10_27_101504_create_sentence_sounds_table', 1),
(7, '2023_09_27_085117_create_tests_table', 1),
(8, '2024_04_01_164729_change_name_column_table_words', 1),
(9, '2024_04_01_165423_add_time_forms_to_table_words', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `abilities` text COLLATE utf8mb4_unicode_ci,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `sentences`
--

CREATE TABLE `sentences` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sentence` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `translation` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `sentences`
--

INSERT INTO `sentences` (`id`, `sentence`, `translation`, `created_at`, `updated_at`) VALUES
(1, 'runs', 'asd', '2024-05-28 17:16:21', '2024-05-28 17:16:21');

-- --------------------------------------------------------

--
-- Структура таблицы `sentence_sounds`
--

CREATE TABLE `sentence_sounds` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sentence_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `tests`
--

CREATE TABLE `tests` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `text` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `json` text COLLATE utf8mb4_unicode_ci,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `words`
--

CREATE TABLE `words` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `word` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `translation` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `description` text COLLATE utf8mb4_unicode_ci,
  `type_id` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'type word',
  `time_forms` text COLLATE utf8mb4_unicode_ci,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `words`
--

INSERT INTO `words` (`id`, `word`, `translation`, `description`, `type_id`, `time_forms`, `created_at`, `updated_at`) VALUES
(1, 'Bread', 'хлеб', '\"брээд\"', 3, NULL, '2024-05-28 10:13:42', '2024-05-28 10:15:16'),
(2, 'milk', 'молоко', '\"мэлк\"', 3, NULL, '2024-05-28 10:33:44', '2024-05-28 10:33:44'),
(3, 'salt', 'соль', '\"солт\"', 3, NULL, '2024-05-28 10:34:30', '2024-05-28 10:34:30'),
(4, 'butter', 'масло', '\"батё\"', 3, NULL, '2024-05-28 10:35:14', '2024-05-28 10:35:14'),
(5, 'tea', 'чай', '\"тии\"', 3, NULL, '2024-05-28 10:35:59', '2024-05-28 10:35:59'),
(6, 'coffee', 'кофе', '\"кофии\"', 3, NULL, '2024-05-28 10:36:42', '2024-05-28 10:36:42'),
(7, 'brag', 'хвастаться', '\"брааг\"', 1, NULL, '2024-05-28 10:37:35', '2024-05-28 10:37:35'),
(8, 'lock', 'замок', '\"лоок\"', 3, NULL, '2024-05-28 10:38:18', '2024-05-28 10:38:18'),
(9, 'call', 'вызвать, назвать', '\"коол\"', 3, NULL, '2024-05-28 10:39:32', '2024-05-28 10:39:32'),
(10, 'thin', 'тонкий, худой', '\"thиин\"', 0, NULL, '2024-05-28 10:41:38', '2024-05-28 10:41:38'),
(11, 'yell', 'кричать', '\"йеел\"', 1, NULL, '2024-05-28 10:42:23', '2024-05-28 10:42:23'),
(12, 'Please', 'пожалуйста', '\"плииз\"', 0, NULL, '2024-05-28 10:43:16', '2024-05-28 10:43:16'),
(13, 'thanks', 'спасибо', '\"сенкс\"', 3, NULL, '2024-05-28 10:44:31', '2024-05-29 09:30:54'),
(14, 'fry', 'жарить, обжаривать', '\"фраай\"', 1, NULL, '2024-05-28 10:49:08', '2024-05-28 10:49:08'),
(15, 'mall', 'торговый центер', '\"моол\"', 0, NULL, '2024-05-28 10:49:55', '2024-05-28 10:49:55'),
(16, 'goodbye', 'до свидания', '\"гюдбай\"', 0, NULL, '2024-05-28 10:51:39', '2024-05-28 10:51:39'),
(17, 'meet', 'встреча', '\"миит\"', 3, NULL, '2024-05-28 10:54:04', '2024-05-28 10:54:04'),
(18, 'nice', 'хороший, приятный', '\"наайс\"', 0, NULL, '2024-05-28 10:57:24', '2024-05-28 10:57:24'),
(19, 'tax', 'налог', '\"таакс\"', 3, NULL, '2024-05-28 10:58:21', '2024-05-28 10:58:21'),
(20, 'beautiful', 'красивый, прекрасный', '\"бьютефол\"', 0, NULL, '2024-05-28 10:59:33', '2024-05-28 10:59:33'),
(21, 'sock', 'носок', '\"соок\"', 3, NULL, '2024-05-28 11:00:26', '2024-05-28 11:00:26'),
(22, 'Russia', 'россия', '\"раша\"', 3, NULL, '2024-05-28 11:01:05', '2024-05-28 11:01:05'),
(23, 'America', 'америка', '\"амэрика\"', 3, NULL, '2024-05-28 11:01:45', '2024-05-28 11:01:45'),
(24, 'France', 'франция', '\"фраанс\"', 3, NULL, '2024-05-28 11:02:18', '2024-05-28 11:02:18'),
(25, 'Mexico', 'мексика', '\"мексико\"', 3, NULL, '2024-05-28 11:03:10', '2024-05-28 11:03:10'),
(26, 'New York', 'Нью-Йорк', '\"нью ёёк\"', 3, NULL, '2024-05-28 11:03:54', '2024-05-28 11:10:51'),
(27, 'Moscow', 'москва', '\"москоу\"', 3, NULL, '2024-05-28 11:09:13', '2024-05-28 11:09:13'),
(28, 'St Petersburg', 'санкт питерсбург', '\"сэнт питесбёг\"', 3, NULL, '2024-05-28 11:10:35', '2024-05-28 11:11:33'),
(29, 'Paris', 'париж', '\"парэс\"', 3, NULL, '2024-05-28 11:11:49', '2024-05-28 11:11:49'),
(30, 'Belarus', 'беларусь', '\"беларюс\"', 3, NULL, '2024-05-28 11:12:45', '2024-05-28 11:12:45'),
(31, 'famous', 'известный, знаменитый', '\"фэймес\"', 0, NULL, '2024-05-28 11:13:50', '2024-05-28 11:13:50'),
(32, 'professor', 'професор', '\"прюфэссо\"', 3, NULL, '2024-05-28 11:15:05', '2024-05-28 11:15:05'),
(33, 'dad', 'папа', '\"даад\"', 3, NULL, '2024-05-28 11:43:46', '2024-05-28 11:43:46'),
(34, 'mom', 'мама', '\"моом\"', 3, NULL, '2024-05-28 11:46:38', '2024-05-28 11:46:38'),
(35, 'brother', 'брат', '\"браthё\"', 3, NULL, '2024-05-28 11:47:34', '2024-05-28 11:47:34'),
(36, 'sister', 'сестра', '\"систё\"', 3, NULL, '2024-05-28 11:48:25', '2024-05-28 11:48:46'),
(37, 'horse', 'лошадь', '\"хоос\"', 3, NULL, '2024-05-28 11:49:29', '2024-05-28 11:49:29'),
(38, 'cord', 'шнур, канатик', '\"коод\"', 3, NULL, '2024-05-28 11:50:50', '2024-05-28 11:50:50'),
(39, 'bag', 'сумка, мешок', '\"бээг\"', 3, NULL, '2024-05-28 11:51:51', '2024-05-28 11:51:51'),
(40, 'where', 'где, куда', '\"вэа\"', 0, NULL, '2024-05-28 11:53:35', '2024-05-28 11:53:35'),
(41, 'when', 'когда', '\"вээн\"', 0, NULL, '2024-05-28 11:55:04', '2024-05-28 11:55:04'),
(42, 'thing', 'вещь, предмет', '\"thиинг\"', 3, NULL, '2024-05-28 11:56:39', '2024-05-28 11:56:47'),
(43, 'granddaughter', 'внучка', '\"граандота\"', 3, NULL, '2024-05-28 11:57:47', '2024-05-28 11:57:47'),
(44, 'need', 'нуждаться, потребность', '\"ниид\"', 1, NULL, '2024-05-28 11:59:51', '2024-05-28 11:59:51'),
(45, 'tomato', 'помидор, томат', '\"томато\"', 3, NULL, '2024-05-28 12:00:42', '2024-05-28 12:00:42'),
(46, 'what', 'что, какой, как', '\"воот\"', 0, NULL, '2024-05-28 12:02:35', '2024-05-28 12:02:35'),
(47, 'some', 'некоторый, кое-какой', '\"саам\"', 0, NULL, '2024-05-28 12:04:46', '2024-05-28 12:04:46'),
(48, 'must', 'должен, надо, нужно', '\"маст\"', 0, NULL, '2024-05-28 12:06:10', '2024-05-28 12:06:10'),
(49, 'knowledge', 'знание, познания', '\"нолэдж\"', 3, NULL, '2024-05-28 12:07:43', '2024-05-28 12:07:43'),
(50, 'sugar', 'сахар, сахарный, сахарить', '\"шюга\"', 3, NULL, '2024-05-28 12:09:30', '2024-05-28 12:09:30'),
(51, 'idea', 'идея', '\"айдэя\"', 3, NULL, '2024-05-28 12:10:18', '2024-05-28 12:10:18'),
(52, 'here', 'здесь, сюда, вот', '\"хия\"', 0, NULL, '2024-05-28 12:11:24', '2024-05-28 12:11:24'),
(53, 'win', 'выйгрыш, заработать, победить', '\"wиин\"', 1, NULL, '2024-05-28 12:14:03', '2024-05-28 12:14:03'),
(54, 'cave', 'пещера, полость', '\"кэйв\"', 3, NULL, '2024-05-28 12:16:40', '2024-05-28 12:16:40'),
(55, 'ready', 'готов, на готове', '\"рэди\"', 0, NULL, '2024-05-28 12:17:46', '2024-05-28 12:17:46'),
(56, 'of course', 'конечно, само сабой', '\"офкоос\"', 0, NULL, '2024-05-28 12:20:47', '2024-05-28 12:20:47'),
(57, 'Welcome', 'добро пожаловать', '\"вэлком\"', 0, NULL, '2024-05-28 12:22:02', '2024-05-28 12:22:02'),
(58, 'family', 'семья, фамильный', '\"фэмэли\"', 3, NULL, '2024-05-28 12:23:11', '2024-05-28 12:23:37'),
(59, 'store', 'магазин, складировать', '\"стоо\"', 3, NULL, '2024-05-28 12:24:58', '2024-05-28 12:24:58'),
(60, 'expensive', 'дорогой', '\"экспэнсив\"', 0, NULL, '2024-05-28 12:25:48', '2024-05-28 12:25:48'),
(61, 'perfect', 'идеальный, безупречный', '\"пэфект\"', 0, NULL, '2024-05-28 12:26:50', '2024-05-28 12:26:50'),
(62, 'lot', 'много, доля', '\"лоот\"', 0, NULL, '2024-05-28 15:41:59', '2024-05-28 15:41:59'),
(63, 'want', 'нуждаться, хотеть', '\"вонт\"', 1, NULL, '2024-05-28 15:43:27', '2024-05-28 15:43:27'),
(64, 'birthday', 'день рождения', '\"бёthдэй\"', 0, NULL, '2024-05-28 15:44:23', '2024-05-28 15:44:23'),
(65, 'can', 'может, иметь право', '\"кан\"', 0, NULL, '2024-05-28 15:46:47', '2024-05-28 15:46:47'),
(66, 'cheap', 'дешевый, доставшийся легко', '\"чиип\"', 0, NULL, '2024-05-28 15:51:58', '2024-05-28 15:51:58'),
(67, 'today', 'сегодня, наши дни', '\"тёдэй\"', 0, NULL, '2024-05-28 15:52:59', '2024-05-28 15:53:14'),
(68, 'jacket', 'куртка, кожух машины', '\"джакет\"', 3, NULL, '2024-05-28 15:54:53', '2024-05-28 15:54:53'),
(69, 'very', 'очень, тот самый', '\"вэри\"', 0, NULL, '2024-05-28 15:56:30', '2024-05-28 15:56:30'),
(70, 'buy', 'купить', '\"бай\"', 1, NULL, '2024-05-28 15:57:01', '2024-05-28 15:57:30'),
(71, 'sell', 'продавать', '\"сээл\"', 1, NULL, '2024-05-28 15:58:44', '2024-05-28 15:58:44'),
(72, 'sale', 'продажа, сбыт', '\"сэйл\"', 3, NULL, '2024-05-28 15:59:59', '2024-05-28 15:59:59'),
(73, 'purchase', 'покупка, закупка', '\"пёчэс\"', 3, NULL, '2024-05-28 16:01:21', '2024-05-28 16:01:21'),
(74, 'great', 'великий, отличный', '\"грэйт\"', 0, NULL, '2024-05-28 16:02:27', '2024-05-28 16:02:27'),
(75, 'steak', 'тонкий кусок мяса', '\"стейк\"', 3, NULL, '2024-05-28 16:09:20', '2024-05-28 16:09:20'),
(76, 'party', 'вечеринка', '\"пати\"', 3, NULL, '2024-05-28 16:10:27', '2024-05-28 16:10:27'),
(77, 'fun', 'веселье, забава', '\"фан\"', 3, NULL, '2024-05-28 16:11:13', '2024-05-28 16:11:13'),
(78, 'long', 'длинный, долгий, долгосрочный', '\"лоон\"', 0, NULL, '2024-05-28 16:11:54', '2024-05-28 16:11:54'),
(79, 'so', 'и так, по этому, такая', '\"соу\"', 0, NULL, '2024-05-28 16:13:52', '2024-05-29 09:33:11'),
(80, 'also', 'тоже, также', '\"олсо\"', 0, NULL, '2024-05-28 16:20:00', '2024-05-28 16:20:00'),
(81, 'song', 'песня', '\"соон\"', 3, NULL, '2024-05-28 16:20:48', '2024-05-28 16:20:48'),
(82, 'teacher', 'учитель', '\"тичё\"', 3, NULL, '2024-05-28 16:21:25', '2024-05-28 16:21:25'),
(83, 'beer', 'пиво', '\"бир\"', 3, NULL, '2024-05-28 16:22:19', '2024-05-28 16:25:06'),
(84, 'bear', 'медведь', '\"бэр\"', 3, NULL, '2024-05-28 16:23:58', '2024-05-28 16:23:58'),
(85, 'week', 'неделя', '\"вык\"', 3, NULL, '2024-05-28 16:29:13', '2024-05-29 09:43:10'),
(86, 'doctor', 'доктор, врач', '\"докта\"', 3, NULL, '2024-05-28 16:29:47', '2024-05-28 16:30:28'),
(87, 'wine', 'вино', '\"вайн\"', 3, NULL, '2024-05-28 16:32:24', '2024-05-28 16:32:24'),
(88, 'Interesting', 'интересный', '\"интерестин\"', 0, NULL, '2024-05-28 16:37:08', '2024-05-28 16:37:08'),
(89, 'tour', 'турпоездка, гастроли', '\"тоур\"', 3, NULL, '2024-05-28 16:39:58', '2024-05-29 09:52:33'),
(90, 'your', 'твой, ваш', '\"ёё\"', 0, NULL, '2024-05-28 16:41:49', '2024-05-30 05:18:44'),
(91, 'coat', 'пальто, пиджак', '\"коут\"', 3, NULL, '2024-05-28 16:47:07', '2024-05-29 10:04:30'),
(92, 'phone', 'телефон', '\"фён\"', 3, NULL, '2024-05-28 16:48:27', '2024-05-28 16:48:27'),
(93, 'phase', 'фаза, этап', '\"фэйз\"', 3, NULL, '2024-05-28 16:49:56', '2024-05-28 16:49:56'),
(94, 'wig', 'парик', '\"выыг\"', 3, NULL, '2024-05-28 16:50:42', '2024-05-28 16:50:42'),
(95, 'wallet', 'кошелек', '\"волэт\"', 3, NULL, '2024-05-28 16:52:13', '2024-05-30 03:42:34'),
(96, 'bye', 'пока', '\"бай\"', 0, NULL, '2024-05-28 16:53:31', '2024-05-28 16:53:31'),
(97, 'night', 'ночь', '\"найт\"', 3, NULL, '2024-05-28 16:54:29', '2024-05-28 16:54:29'),
(98, 'good', 'хорошо, добро', '\"гююд\"', 0, NULL, '2024-05-28 16:55:37', '2024-05-28 16:55:37'),
(99, 'hand', 'рука', '\"хэнд\"', 3, NULL, '2024-05-28 17:09:22', '2024-05-28 17:09:22'),
(100, 'runs', 'бежит, подбегать', '\"ранс\"', 0, NULL, '2024-05-28 17:10:44', '2024-05-29 14:10:16'),
(102, 'sorry', 'извени', '\"сори\"', 0, NULL, '2024-05-29 09:48:44', '2024-05-29 09:48:44'),
(103, 'Excuse me', 'извени', '\"экскюз ми\"', 0, NULL, '2024-05-29 09:49:19', '2024-05-29 09:49:19'),
(104, 'evening', 'вечер', '\"ивнин\"', 3, NULL, '2024-05-29 11:24:34', '2024-05-29 11:24:34'),
(105, 'answer', 'ответ', '\"ансё\"', 1, NULL, '2024-05-29 12:16:52', '2024-05-29 12:16:52'),
(106, 'late', 'поздно, опаздывающий', '\"лэйт\"', 0, NULL, '2024-05-29 12:25:11', '2024-05-29 12:25:11'),
(107, 'enjoy', 'наслаждаться', '\"энджой\"', 0, NULL, '2024-05-29 12:26:22', '2024-05-29 12:26:22'),
(108, 'talking', 'говорить', '\"токин\"', 0, NULL, '2024-05-29 13:52:44', '2024-05-29 13:52:44'),
(109, 'pants', 'брюки, штаны', '\"пантс\"', 0, NULL, '2024-05-29 13:57:32', '2024-05-29 13:57:32'),
(110, 'man', 'мужчина', '\"мэн\"', 3, NULL, '2024-05-29 13:59:31', '2024-05-29 13:59:31'),
(111, 'near', 'около, возле', '\"ныё\"', 0, NULL, '2024-05-29 14:04:02', '2024-05-29 14:04:02'),
(112, 'sick', 'больной', '\"сик\"', 0, NULL, '2024-05-29 14:06:20', '2024-05-30 05:33:18'),
(113, 'sees', 'видит', '\"сииз\"', 0, NULL, '2024-05-29 14:08:54', '2024-05-29 14:08:54'),
(114, 'talk', 'разговаривать', '\"тоок\"', 1, NULL, '2024-05-29 14:12:39', '2024-05-29 14:12:39'),
(115, 'her', 'её, ей', '\"хё\"', 0, NULL, '2024-05-29 14:14:48', '2024-05-29 14:14:48'),
(116, 'my', 'мой, моё, мои, моя', '\"май\"', 0, NULL, '2024-05-30 05:17:21', '2024-05-30 05:17:21'),
(117, 'his', 'его', '\"хиз\"', 0, NULL, '2024-05-30 05:19:32', '2024-05-30 05:19:32'),
(118, 'its', 'его, её - неодушевленный предмет', '\"итс\"', 0, NULL, '2024-05-30 05:21:37', '2024-05-30 05:21:37'),
(119, 'our', 'наш, наши, наше, наша', '\"ауа\"', 0, NULL, '2024-05-30 05:22:53', '2024-05-30 05:22:53'),
(120, 'their', 'их', '\"зэа\"', 0, NULL, '2024-05-30 05:24:00', '2024-05-30 05:24:00'),
(121, 'basketball', 'баскетбол', NULL, 0, NULL, '2024-05-30 05:26:23', '2024-05-30 05:26:23'),
(122, 'bite', 'кусать, кусаться, разгрызать', '\"байт\"', 1, NULL, '2024-05-30 05:34:48', '2024-05-30 05:35:46'),
(123, 'rock', 'рок, камень, горная порода', '\"рок\"', 3, NULL, '2024-05-30 05:38:07', '2024-05-30 05:38:07'),
(124, 'they', 'они', '\"зэй\"', 0, NULL, '2024-05-30 05:45:22', '2024-05-30 05:45:22'),
(125, 'yesterday', 'вчера', '\"естудэй\"', 0, NULL, '2024-05-30 05:47:23', '2024-05-30 05:47:23'),
(126, 'tomorrow', 'завтра', '\"туморо\"', 0, NULL, '2024-05-30 05:48:38', '2024-05-30 05:48:38'),
(127, 'really', 'действительно', '\"рылей\"', 0, NULL, '2024-05-30 05:50:37', '2024-05-30 05:50:37'),
(128, 'soccer', 'футбол', '\"сокё\"', 0, NULL, '2024-05-30 05:56:28', '2024-05-30 05:56:28'),
(129, 'cart', 'тележка, повозка', '\"корт\"', 3, NULL, '2024-05-30 06:47:37', '2024-05-30 11:30:29'),
(130, 'hot', 'горячий, жарко', '\"хот\"', 0, NULL, '2024-05-30 06:48:43', '2024-05-30 06:48:43'),
(131, 'favorite', 'любимый, излюбленый', '\"фэйворет\"', 0, NULL, '2024-05-30 06:52:31', '2024-05-30 06:52:31'),
(132, 'husband', 'муж, супруг', '\"хазбэнд\"', 3, NULL, '2024-05-30 06:56:54', '2024-05-30 06:56:54'),
(133, 'wife', 'жена', '\"вайф\"', 3, NULL, '2024-05-30 06:57:48', '2024-05-30 06:57:48'),
(134, 'safe', 'безопасный, безпроигрышный', '\"сэйф\"', 0, NULL, '2024-05-30 07:01:24', '2024-05-30 07:01:24'),
(135, 'hockey', 'хокей', NULL, 0, NULL, '2024-05-30 07:03:09', '2024-05-30 07:03:09'),
(136, 'ballet', 'балет', '\"балэй\"', 0, NULL, '2024-05-30 07:11:12', '2024-05-30 07:11:12'),
(137, 'sing', 'петь, припевать', '\"син\"', 1, NULL, '2024-05-30 07:15:07', '2024-05-30 07:15:07'),
(138, 'sweet', 'сладкий, аромат', '\"свит\"', 0, NULL, '2024-05-30 07:19:14', '2024-05-30 07:19:14'),
(139, 'cook', 'готовить, повар, кулинар', '\"кок\"', 1, NULL, '2024-05-30 07:28:19', '2024-05-30 07:28:19'),
(140, 'swim', 'плавать, переплывать', '\"свим\"', 1, NULL, '2024-05-30 07:30:03', '2024-05-30 07:30:11'),
(141, 'daughter', 'дочь, дочерний', '\"дота\"', 3, NULL, '2024-05-30 07:32:50', '2024-05-30 15:46:54'),
(142, 'hobby', 'увлечение', '\"хоби\"', 0, NULL, '2024-05-30 09:28:44', '2024-05-30 09:28:44'),
(143, 'son', 'сын', '\"сан\"', 3, NULL, '2024-05-30 09:31:03', '2024-05-30 09:31:03'),
(144, 'too', 'слишком', '\"тю\"', 0, NULL, '2024-05-30 09:33:19', '2024-05-30 09:33:19'),
(145, 'chin', 'подбородок', '\"чин\"', 0, NULL, '2024-05-30 09:35:17', '2024-05-30 09:35:17'),
(146, 'cool', 'класный, прохладный, холодить', '\"кул\"', 0, NULL, '2024-05-30 09:37:28', '2024-05-30 09:37:28'),
(147, 'chess', 'шахматы', '\"чес\"', 0, NULL, '2024-05-30 09:39:39', '2024-05-30 09:39:39'),
(148, 'brown', 'коричневый', '\"браун\"', 0, NULL, '2024-05-30 10:15:22', '2024-05-30 10:15:22'),
(149, 'warm', 'теплый, согретый', '\"вом\"', 0, NULL, '2024-05-30 10:18:24', '2024-05-30 10:18:24'),
(150, 'jazz', 'джаз, эстрадный оркестр, яркие краски', '\"джаз\"', 0, NULL, '2024-05-30 11:42:24', '2024-05-30 11:42:24'),
(151, 'play', 'играть', '\"плэй\"', 1, NULL, '2024-05-30 16:00:45', '2024-05-30 16:00:45'),
(152, 'sitting', 'сидит, сидение', '\"ситин\"', 0, NULL, '2024-05-30 16:40:50', '2024-05-30 16:40:50'),
(153, 'together', 'вместе, воедино', '\"тогеthё\"', 0, NULL, '2024-05-30 16:43:22', '2024-05-30 16:43:22'),
(154, 'school', 'школа, школьный', '\"скул\"', 0, NULL, '2024-05-30 16:44:49', '2024-05-30 16:44:49'),
(155, 'bus', 'автобус', '\"бас\"', 3, NULL, '2024-05-30 16:46:14', '2024-05-30 16:46:14'),
(156, 'there', 'там, туда', '\"зэа\"', 0, NULL, '2024-05-30 16:48:34', '2024-05-30 16:48:34'),
(157, 'huh', 'хм', NULL, 0, NULL, '2024-05-30 16:50:55', '2024-05-30 16:50:55'),
(158, 'father', 'отец', '\"фаthё\"', 3, NULL, '2024-05-30 16:52:17', '2024-05-30 16:52:17'),
(159, 'write', 'писать, вводить информацию', '\"врайт\"', 1, NULL, '2024-05-30 16:53:26', '2024-05-30 16:57:43'),
(160, 'speak', 'говорить, изьясняться', '\"спик\"', 1, NULL, '2024-05-30 16:56:23', '2024-05-30 16:56:23'),
(161, 'language', 'языковой язык писателя', '\"лангвэдж\"', 3, NULL, '2024-05-30 17:00:21', '2024-05-30 17:00:21'),
(162, 'intteligent', 'умный, смышленный', '\"интелиджент\"', 0, NULL, '2024-05-30 17:05:05', '2024-05-30 17:05:05'),
(163, 'tall', 'высокий', '\"тол\"', 0, NULL, '2024-05-30 17:06:38', '2024-05-30 17:06:38'),
(164, 'shoes', 'обувь', '\"шююз\"', 0, NULL, '2024-05-30 17:09:59', '2024-05-30 17:09:59'),
(165, 'behind', 'сзади, позади', '\"бэхаинд\"', 0, NULL, '2024-05-30 17:12:51', '2024-05-30 17:12:51'),
(166, 'remote', 'дистанционный, удаленный', '\"ремоут\"', 0, NULL, '2024-05-31 05:12:17', '2024-05-31 05:12:17'),
(167, 'break', 'сломать, разбить, перерыв', '\"брейк\"', 0, NULL, '2024-05-31 10:35:47', '2024-05-31 10:35:47');

-- --------------------------------------------------------

--
-- Структура таблицы `word_types`
--

CREATE TABLE `word_types` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `type` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `color` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `word_types`
--

INSERT INTO `word_types` (`id`, `type`, `color`, `description`) VALUES
(1, 'глагол', '#007bff', '{\"text\":\"\\u043e\\u0442\\u0432\\u0435\\u0447\\u0430\\u0435\\u0442 \\u043d\\u0430 \\u0432\\u043e\\u043f\\u0440\\u043e\\u0441\\u044b \\u0447\\u0442\\u043e \\u0434\\u0435\\u043b\\u0430\\u0442\\u044c? \\u0447\\u0442\\u043e \\u0441\\u0434\\u0435\\u043b\\u0430\\u0442\\u044c?\",\"object\":null}'),
(2, 'подлежащее', '#28a745', '{\"text\":\"\\u0434\\u0435\\u0439\\u0441\\u0442\\u0432\\u0438\\u0435, \\u0441\\u043e\\u0441\\u0442\\u043e\\u044f\\u043d\\u0438\\u0435, \\u0441\\u0432\\u043e\\u0439\\u0441\\u0442\\u0432\\u043e, \\u043a\\u0430\\u0447\\u0435\\u0441\\u0442\\u0432\\u043e\",\"object\":null}'),
(3, 'существительное', '#cc9a03', '{\"text\":\"\\u0418\\u043c\\u0435\\u044e\\u0442 \\u0435\\u0434\\u0438\\u043d\\u0441\\u0442\\u0432\\u0435\\u043d\\u043d\\u043e\\u0435 \\u0438 \\u043c\\u043d\\u043e\\u0436\\u0435\\u0441\\u0442\\u0432\\u0435\\u043d\\u043d\\u043e\\u0435 \\u0447\\u0438\\u0441\\u043b\\u043e \\u0441 \\u043f\\u0440\\u0438\\u0441\\u0442\\u0430\\u0432\\u043a\\u043e\\u0439 \\u201cs\\u201d \\u0432 \\u043a\\u043e\\u043d\\u0446\\u0435. <br\\/>\\r\\n\\u041e\\u043d\\u0438 \\u0438\\u0441\\u043f\\u043e\\u043b\\u044c\\u0437\\u0443\\u044e\\u0442\\u0441\\u044f \\u0441 (the) \\u0438\\u043b\\u0438 (a, an) \\u0430\\u0440\\u0442\\u0438\\u043a\\u043b\\u044f\\u043c\\u0438 - \\\"a book\\\" \\u0438\\u043b\\u0438 \\\"the car\\\". <br\\/>\\r\\n\\\"the\\\" \\u043a\\u043e\\u0433\\u0434\\u0430 \\u0440\\u0435\\u0447\\u044c \\u0438\\u0434\\u0435\\u0442 \\u043e \\u043e\\u0431\\u044a\\u0435\\u043a\\u0442\\u0435, \\u043a\\u043e\\u0442\\u043e\\u0440\\u044b\\u0439 \\u0438\\u0437\\u0432\\u0435\\u0441\\u0442\\u0435\\u043d \\u0438\\u043b\\u0438 \\u0443\\u043f\\u043e\\u043c\\u0438\\u043d\\u0430\\u0435\\u0442\\u0441\\u044f \\u0440\\u0430\\u043d\\u0435\\u0435 - \\\"She bought the book\\\". <br\\/>\\r\\n\\u0410\\u0440\\u0442\\u0438\\u043a\\u043b\\u044c \\u043d\\u0435 \\u0441\\u0442\\u0430\\u0432\\u0438\\u0442\\u0441\\u044f \\u043f\\u0435\\u0440\\u0435\\u0434: <br\\/>\\r\\n\\u041c\\u043d\\u043e\\u0436\\u0435\\u0441\\u0442\\u0432\\u0435\\u043d\\u043d\\u044b\\u043c \\u0447\\u0438\\u0441\\u043b\\u043e\\u043c \\u0438 \\u043f\\u043e\\u0441\\u043b\\u0435 \\u0447\\u0438\\u0441\\u043b\\u0438\\u0442\\u0435\\u043b\\u044c\\u043d\\u043e\\u0433\\u043e \\\"have boys and one girl\\\" <br\\/>\\r\\n\\u041f\\u043e\\u0441\\u043b\\u0435 \\u043f\\u0440\\u0438\\u0442\\u044f\\u0436\\u0430\\u0442\\u0435\\u043b\\u044c\\u043d\\u044b\\u0445 \\u043c\\u0435\\u0441\\u0442\\u043e\\u0438\\u043c\\u0435\\u043d\\u0438\\u0439 \\\"my, your, our, their, his, her\\\" <br\\/>\\r\\n\\\"a\\\" \\u0441\\u0442\\u0430\\u0432\\u0438\\u0442\\u0441\\u044f \\u043f\\u0435\\u0440\\u0435\\u0434 \\u0441\\u043e\\u0433\\u043b\\u0430\\u0441\\u043d\\u043e\\u0439 \\u0431\\u0443\\u043a\\u0432\\u043e\\u0439 \\\"I need a new computer.\\\" <br\\/>\\r\\n\\\"an\\\" \\u0441\\u0442\\u0430\\u0432\\u0438\\u0442\\u0441\\u044f \\u043f\\u0435\\u0440\\u0435\\u0434 \\u0433\\u043b\\u0430\\u0441\\u043d\\u043e\\u0439 \\\"an interesting movie\\\"\\r\\n\",\"object\":null}'),
(4, 'формы времени', '#dc3545', '{\"text\":null,\"object\":{\"past\":{\"word\":null,\"translation\":null,\"accent\":null},\"present\":{\"word\":null,\"translation\":null,\"accent\":null},\"future\":{\"word\":null,\"translation\":null,\"accent\":null}}}');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Индексы таблицы `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Индексы таблицы `sentences`
--
ALTER TABLE `sentences`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `sentence_sounds`
--
ALTER TABLE `sentence_sounds`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sentence_sounds_sentence_id_index` (`sentence_id`);

--
-- Индексы таблицы `tests`
--
ALTER TABLE `tests`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `words`
--
ALTER TABLE `words`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `word_types`
--
ALTER TABLE `word_types`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT для таблицы `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `sentences`
--
ALTER TABLE `sentences`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `sentence_sounds`
--
ALTER TABLE `sentence_sounds`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `tests`
--
ALTER TABLE `tests`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `words`
--
ALTER TABLE `words`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=168;

--
-- AUTO_INCREMENT для таблицы `word_types`
--
ALTER TABLE `word_types`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `sentence_sounds`
--
ALTER TABLE `sentence_sounds`
  ADD CONSTRAINT `sentence_sounds_sentence_id_foreign` FOREIGN KEY (`sentence_id`) REFERENCES `sentences` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
